OdRxAttributeCollection.remove(OdRxAttribute!System.Runtime.CompilerServices.IsConst*)
\details
Removes the attribute of that type from the collection.
\param attribute [in]  Attribute to be removed from the collection.
\returns
eOk if the attribute is removed successfully, or eKeyNotFound otherwise.

OdRxAttributeCollection.override(OdRxAttribute!System.Runtime.CompilerServices.IsConst*)
\details
Adds an attribute to the collection. If the collection already has an
attribute of this class, it will be replaced.
\param attribute [in]  Attribute to be added to the collection.
\returns
eOk if the attribute is added to the collection successfully, or eInvalidInput if the attribute parameter is
invalid.

OdRxAttributeCollection.add(OdRxAttribute!System.Runtime.CompilerServices.IsConst*)
\details
Add an attribute to the collection. If the collection already has an
attribute of this class, it will not be replaced.
\param attribute [in]  Attribute to be added to the collection.
\returns
eOk if an attribute is added to the collection successfully; eInvalidInput if the attribute parameter is
invalid; eDuplicateKey if the collection already has an attribute of this
type.

OdRxAttributeCollection.get(OdRxClass!System.Runtime.CompilerServices.IsConst*)
\details
Finds the attribute of the given class in the collection (constant version).
\param type [in]  Class of the attribute to be found.
\returns Pointer to the attribute of the given class.
\remarks
Returns 0 if the attribute of the given class in the collection is not found.
\details
Finds the attribute of the given class in the collection.
\param type [in]  Class of the attribute to be found.
\returns Pointer to the attribute of the given class.
\remarks
Returns 0 if the attribute of the given class in the collection is not found.

OdRxAttributeCollection.getAt(System.Int32)
\details
Retrieves the attribute at the specified index (constant version).
\param index [in]  Index of the attribute to be retrieved.
\returns Pointer to the attribute at the given index.
\details
Retrieves the attribute at the specified index (non-constant version).
\param index [in]  Index of the attribute to be retrieved.
\returns Pointer to the attribute at the given index.

OdRxAttributeCollection.count
\details
Gets the number of elements in the collection.
\returns Number of elements in the collection.

OdRxAttributeCollection.Dispose
\details
Default destructor. Destroys the OdRxAttributeCollection object.

OdRxAttributeCollection.#ctor
\details
Default constructor. Creates an OdRxAttributeCollection instance with default parameters.